Repository: matturche/hskgrader
Catalog: locales/*/LC_MESSAGES/hskgrader.po
Languages: fr

source: WELCOME TO HSK GRADER :snake:
fr: BIENVENUE SUR HSK GRADER :snake:

source: What is it?
fr: Qu'est ce que c'est ?

source: It is a small app to analyze Chinese texts using the **Hànyǔ Shuǐpǐng Kǎoshì (HSK)** dictionnary entries. :red[*Note that the author(s) of this tool are not affiliated in any way with the Hanban/Confucius Institute Headquarters, responsible for all things related to the HSK.*]
fr: C'est une simple application pour analyser des textes chinois en utilisant le vocabulaire du **Hànyǔ Shuǐpǐng Kǎoshì (HSK)**, le test standard pour le mandarin en Chine continentale. :red[*Veuillez noter que les auteurs de cette application ne sont affiliés en aucun cas avec le Hanban ou la direction des Instituts Confucius, qui sont responsables de tout ce qui touche au HSK.*]

source: Who is it for?
fr: A qui est destinée cette application ?

source: For teachers who want to evaluate the difficulty of a text that they want to give to their students, or for learners who want to start reading real world texts but are unsure if they are up to the task.
fr: Aux professeurs qui veulent évaluer la difficulté d'un texte qu'ils souhaitent donner à leurs étudiants, ou aux étudiants eux-mêmes qui désirent lire des textes qu'ils trouvent mais ne savent pas si celui-ci correspond à leur niveau.

source: Learn more
fr: Dis m'en plus

source: The test is divided into 6 main levels (or bands), with the recent addition of the 7 to 9th levels, in a single block. Each level reflects what is expected from a learner's abilities in Chinese, and they also serve as frameworks for learners when they study Chinese. Thus, knowing what is the expected HSK content in a text can be a good indicator when wanting to read a text. However, there existed no tool to my knowledge which allowed to analyse the content of a text and map it to an existing HSK level, which poses problem as a learner might want to know whether a text is accessible to them right now, if they will need a lot of effort to understand it, or if it's going to be an easy read. Most textbooks provide texts with a readability of around 80% (the number of words a learner knows), which generally makes the text challenging and require the learner's focus, and is pretty exhausting, having to check definitions at almost every sentences. On the other hand, a good text for extensive reading will sit at around 98% of known words, allowing the learner to guess from context the new words that get introduced, and is generally better for assimilating grammar structures, as you don't have to stop to check a dictionnary all the time. If you want to get a feeling of what it's like to read something at a given readability percentage, I recommend this [article](https://www.hackingchinese.com/introduction-extensive-reading-chinese-learners/). The main takeway is that 80% readability does not necessarily translate to 80% comprehension, sometimes, it can even be closer to 0.
fr: Le test est divisé en 6 niveaux principaux (aussi appelés "bands" en anglais), avec le récent ajout des niveaux 7 à 9, en un seul bloc (et donc un seul test). Chaque niveau correspond à des attentes envers les compétences d'un apprenant de la langue chinoise, et sert aussi de carcan d'apprentissage. Ainsi, le niveau HSK est un bon indicateur pour déterminer la difficulté d'un texte. Cependant, à notre connaissance, il n'existait aucun outil permettant d'analyser un texte et d'y associer un niveau HSK. Cela pose problème car un étudiant peut avoir envie de savoir si un texte lui est accessible et s'il aura besoin de faire beaucoup d'effort pour le comprendre, ou si au contraire il peut l'apprécier sans se servir de dictionnaire. La plupart des manuels proposent des textes avec une lisibilité de 80% environ pour le niveau qu'ils enseignent, rendant leur lecture accessible bien que nécessitant un effort de concentration non négligeable et la présence de définitions pour les mots inconnus. Ce cas d'usage est approprié pour un cours, car sous la direction d'un professeur, le texte devient un point d'appuis pour s'approprier de nouvelles connaissances. En revanche, cela ne l'est pas pour une lecture de loisir, où l'on attendra d'un texte qu'il se situe aux alentours de 98% de mots connus, permettant ainsi au lecteur de s'approprier les mots inconnus grâce au contexte, ainsi que de s'imprégner des structures grammaticales présentes. Si vous pouvez lire l'anglais, vous pouvez aller jeter un œil à cet [article](https://www.hackingchinese.com/introduction-extensive-reading-chinese-learners/), qui illustre très bien la contradiction qui peut exister entre lisibilité et compréhension, deux concepts qui ne sont pas équivalents. On peut lire un texte dont on comprend 80% des mots, mais dont on ne comprend que des fragments.

source: Text analysis
fr: Analyse de texte

source: How to interpret results
fr: Comment interpréter les résultats

source: HSK stats
fr: Stats du HSK

source: Vocabulary lists
fr: Listes de vocabulaire

source: You can pick a sample text to analyze
fr: Vous pouvez choisir un texte échantillon à analyser

source: No text selected
fr: Aucun texte séléctioné

source: All texts are from HSK2.0 **mock tests** or from the **Standard Course Workbooks** (edited by the Hanban)
fr: Tous les textes proviennent de **tests blancs** du HSK2.0 ou des manuels d'exercices **Standard Course Workbooks** (édités par le Hanban)

source: Text to analyze:
fr: Texte à analyser :

source: Write your text here, ex: 我是法国人。
fr: Écrivez votre texte ici, ex : 我是法国人。

source: The textbox can be resized on the bottom right corner.
fr: La zone de texte peut être redimensionnée en bas à droite.

source: Use sub-words combinations in case matching fails
fr: Utiliser la décomposition des mots dans le cas où la détection échoue

source: e.g. given a word ABCD, it is broken down into: [ABC, AB, A, BCD, BC, B, CD, C, D], and we match against all of them, the final score corresponds to the maximum level found.
fr: e.g. supposons un mot dans le format ABCD, celui-ci est décomposé en : [ABC, AB, A, BCD, BC, B, CD, C, D], et ensuite on relance la détection sur tous ces cas. Le score final correspond au niveau maximum trouvé parmi la combinaison.

source: Use custom expansion dictionary
fr: Utiliser le dictionnaire d'expansion personnalisé

source: Words that are not included in the HSK2.0 list but have been added because they are merely extansions of other words already learned.
fr: Le dictionnaire contient les mots qui ne sont pas inclus dans la liste du HSK2.0 mais qui pourraient/devraient y figurer car ils ne sont que l'extension de mots qui y figurent déjà.

source: Readability
fr: Lisibilité

source: Annotated text
fr: Texte annoté

source: Word counts
fr: Totaux de mots

source: HSK2.0 annotated text
fr: Texte annoté avec HSK2.0

source: HSK3.0 annotated text
fr: Texte annoté avec HSK3.0

source: Both texts
fr: Les deux annotations

source: HSK2.0 ({total_words} words)
fr: HSK2.0 ({total_words} mots)

source: HSK3.0 ({total_words} words)
fr: HSK3.0 ({total_words} mots)

source: Your text doesn't contain any hanzi, there is nothing to analyze.
fr: Votre texte ne contient aucun hanzi, il n'y a rien à analyser.

source: How to interpret readability?
fr: Comment interpréter la lisibilité ?

source: HSK Grader's main objective is to give HSK levels at which a text is most likely readable. When giving a HSK level for a given readability threshold, it means that if you passed, or studied all the vocabulary for this level, then you should be able to read the text with this threshold. For example, if the text is graded as having a readability of 80% at HSK5, you need to have mastered HSK5 content.
fr: Le principal objectif de HSK Grader est de donner les niveaux de HSK auxquels le texte donné est lisible. Lorsqu'un un niveau est associé à un seuil de lisibilité, cela veut dire que si vous avez passé, ou étudié, tous le vocabulaire de ce niveau, alors vous devriez être capable de lire le texte avec la lisibilité associée. Par exemple, si un texte est analysé comme ayant une lisibilité de 80% au HSK5, alors vous devez maitriser le contenu du HSK5 pour que cela soit représentatif.

source: What are 'intensive' and 'extensive' reading?
fr: Qu'est-ce que la lecture "intensive" et "extensive" ?

source: Intensive reading sits at around 80% readability, and is generally what you would expect from texts at a learner's level that they would study in class. These texts are usually accompanied by a vocabulary list so that learners can read the text without too much trouble. If a learner were to read a text like this outside of textbook, it means they will probably be fine but will have to check every now and then a dictionary and may find it exhausting after a short period. This is why extensive reading is recommended for leisure reading, it sits at the right balance between known and unknown words. It allows learners to be able to guess from context some words' meaning without having to check a dictionary, although in Chinese it is a little different, as when you don't recognize a hanzi you still have to check it in a dictionary either way.
fr: La lecture intensive correspond à une lisibilité de 80% environ, et est généralement associée aux textes qui sont étudiés en classe, c'est à dire qu'ils sont lisibles dans les grandes lignes, mais nécessitent l'accompagnement d'un professeur pour en tirer toute la signification. Ces textes sont généralement assortis de liste de vocabulaire pour que l'étudiant puisse le comprendre sans trop de problème. Si un étudiant devait lire ce genre de texte en dehors du cadre de la classe et sans la liste de vocabulaire qui va avec, il n'aurait probablement pas trop de difficulté à en faire sens avec l'usage d'un dictionnaire mais devrait se fatiguer assez vite. Ce seuil n'est donc pas approprié pour de longues sessions de lecture. C'est pourquoi la lecture dite extensive est recommandée pour le loisir, elle correspond à un bon équilibre entre mots connus et inconnus pour pouvoir deviner, grâce au contexte, le sens de ces derniers. Cependant, en chinois il faut y ajouter une difficulté supplémentaire, même si l'on peut deviner ce qu'un mot veut dire, si l'on ne connait pas le/les hanzi associés, alors un dictionnaire doit tout de même être consulté pour la prononciation.

source: The app is showing 80/95/98% readability at a level higher than I should be but I can still read the text fine, why?
fr: L'application donne une lisibilité de 80/95/98% à un niveau plus élevé que je suis mais je peux quand même lire le texte sans problème, pourquoi ?

source: Between theoretical readability and actual readability exists a difference, specific to every individual. The grade given here is conservative, because there might be some undetected words, and it also takes HSK levels at face value. But in reality, the vocabulary people learn is influenced by factors outside of just HSK levels, including but not limited to: nationality, center of interests, exposure to the language, specific needs... Sometimes, a text might have few complicated words, but appearing often, raising the difficulty of the text only on a surface level. Thus the difference between 80%, 95% and 98% might be more blurry if you are already familiar with the text's context, or have already studied its topic previously.
fr: Il existe une différence entre lisibilité théorique et pratique, qui change de personne en personne. Le niveau donné par HSK Grader est conservateur, car il se peut qu'il y ait des mots qui ne soient pas détectés, et l'application applique à la lettre les listes de vocabulaire données avec le HSK. Sauf qu'en pratique, le vocabulaire qu'une personne apprend au cours du temps va bien au-delà de simples listes données par telle ou telle organisation, et est influencé par de multiples facteurs, tels que mais non limités à : la nationalité, les centres d'intérêt, l'exposition au langage, les besoins spécifiques à un instant t... Parfois, un texte peut avoir peu de mots compliqués, mais ceci apparaissent souvent, augmentant artificiellement la difficulté réelle de celui-ci. Ainsi, la limite entre 80%, 95% et 98% peut être beaucoup plus flexible suivant si vous êtes déjà familier avec le contenu du texte, ou si vous avez déjà étudié d'autres textes similaires ou qui traitent du même sujet.

source: The app is showing 80/95/98% readability at HSK7-9 but the actual score is lower, why?
fr: L'application donne un lisibilité de 80/95/98% pour HSK7-9 mais le score réel est inférieur, pourquoi ?

source: HSK7-9 is the default maximum rating for each thresholds, because if you got to HSK7-9, then you should have no problem whatsoever in reading most texts. We could say that most of them have a readability of 100% at this level. The reason as to why it is not true with the app grading is simply because HSK entries are limited, and do not reflect completely the actual number of words one can read when reaching given levels, this is why HSK Grader is using a custom dictionnary. As it is expanded, the accuracy of grading will improve.
fr: HSK7-9 est le rang maximum par défaut pour tous les seuils, parce que si vous êtes à ce niveau, alors vous ne devriez avoir aucun problème à lire la très grande majorité des textes trouvables. Par principe, les textes ont en quelque sorte une lisibilité proche de 100% à ce niveau. La raison pour laquelle le score donné peut être inférieur est simplement parce que la liste de vocabulaire du HSK est limitée, et ne représente pas fidèlement le nombre réel de mots qu'une personne ayant atteint HSK7-9 puisse lire. C'est pourquoi HSK Grader utilise un dictionnaire personnalisé, et au fur et à mesure qu'il est étendu, les scores donnés seront de plus en plus précis.

source: Custom vocabulary ({length} words)
fr: Vocabulaire personnalisé ({length} mots)

source: Reflections on word counts
fr: Réflexions sur le total de mots

source: As we can see, the main difference between HSK2.0 and HSK3.0 is the number of words per level. The HSK2.0 doesn't catch up in vocabulary bulk up until the 6th level, which used to be the highest level available. The main issue with each band of HSK2.0 was that from HSK2 onward, the amount of vocabulary required doubled, marking huge spikes in later levels. HSK3.0 seems to solve this issue, by leveling each band to around 1000 vocabulary. By looking at numbers alone, one could think that the addition of so many words in early levels of HSK3.0 translates to a higher difficulty. While this may be true for the very beginning, when looking at the actual words introduced, one realise that they have added many variants of words already present in HSK2.0, or extended them. This makes the HSK3.0 a better dictionnary for raw entries, but the actual perceived difficulty is most probably not as great as we think between the two versions. Another thing to notice, is that out of the 5657 introduced words inside the HSK7-9 band, more than 1600 are already in use in HSK2.0.
fr: Comme on peut l'observer, la différence principale entre HSK2.0 et HSK3.0 se situe dans le nombre de mots par niveau. La version 2.0 ne rattrape en nombre brut la version 3.0 qu'à partir du niveau 6, qui était jusqu'à il y a peu le plus haut niveau qu'on puisse passer. Le principal problème de chaque niveau avec HSK2.0 était qu'à partir du niveau 2, le montant de mots requis à chaque niveau doublait, créant ainsi de grands pics dans les niveaux avancés. Dans le HSK3.0 ce problème disparait, car chaque niveau comprend environ 1000 mots à apprendre. En s'attardant uniquement sur le nombre de mots brut par niveau, on pourrait croire que l'ajout d'autant de mots à chaque niveau du HSK3.0 se traduise par un examen plus difficile que le HSK2.0 pour un niveau équivalent. Bien que ce soit vrai pour les premiers niveaux, si l'on regarde attentivement le corpus de mots ajoutés par la version 3.0, on se rend compte que beaucoup d'entre eux sont des variantes de mots déjà présents dans la version 2.0, ou alors sont des extensions de mots déjà présents. Cela fait des listes du HSK3.0 de meilleures listes pour les entrées brutes et pour la détection, mais la difficulté de celles-ci n'est pas aussi dure que si pour chaque mot, de nouveaux hanzi étaient introduits. Une dernière chose sur laquelle on peut s'attarder : parmi les 5657 mots introduits par les nouveaux niveaux 7-9, plus de 1600 sont déjà présents dans les 6 niveaux du HSK2.0.

source: Words introduced by HSK3.0 (without HSK7-9)
fr: Mots introduits avec HSK3.0 (sans HSK7-9)

source: HSK2.0 words removed from HSK3.0
fr: Mots du HSK2.0 retirés du HSK3.0

source: HSK2.0 unique hanzi by level
fr: Hanzi uniques par niveau du HSK2.0

source: HSK3.0 unique hanzi by level
fr: Hanzi uniques par niveau du HSK3.0

source: Reflections on unique hanzi in HSK
fr: Réflexions sur les hanzi uniques dans le HSK

source: One of the biggest issue with HSK2.0 is that in early levels, despite a low word count, it introduced many hanzi. This is especially visible on HSK1 where 174 unique hanzi are introduced for only 150 words! This is very detrimental for a learner's understanding on how hanzi, and the Chinese writing system actually works. And as levels increase, more and more are introduced. This is something that the team behind the HSK must have acknowledged, because as we can see the distribution of new hanzi is completely different in HSK3.0. Every band until the last introduces exactly 300 unique hanzi and uses them to build its vocabulary bulk. This is a very good improvement, as it means learners can leverage more vocabulary using less hanzi: three times over the number of hanzi they have to learn at HSK5. However, this has for effect that while learners from HSK2.0 and HSK3.0 roughly have around the same number of hanzi at their disposal at HSK5, it is completely different at HSK6. HSK2.0 and HSK3.0 have a difference of more than 860 hanzi, in favor of HSK2.0. This difference accounts for the straight removal of 414 words from HSK3.0 in HSK6 and the displacement of 1600 entries from inferior levels to HSK7-9. From a pure word count point of view, it would seem that while HSK2.0 and HSK3.0 HSK6 levels get you to the same amount of vocabulary, but when looking at individual hanzi introduced, it seems that HSK2.0's HSK6 band is much more advanced than its HSK3.0 counterpart.
fr: L'un des plus gros problèmes du HSK2.0 est que dans les premiers niveaux, en dépit d'un nombre de mots introduits très faible, le nombre de hanzi introduits lui en revanche était très élevé. C'est particulièrement le cas dans le niveau 1, où 174 hanzi uniques sont introduits pour seulement 150 mots ! C'est un obstacle assez important pour l'étudiant dans sa compréhension du système d'écriture chinois, et de comment les hanzi sont en réalité constitués. Au fil des niveaux, de plus en plus de hanzi doivent être appris. L'équipe derrière le HSK devait être consciente de ce problème, car celui-ci disparait complètement dans la version 3.0. Chaque niveau est accompagné d'exactement 300 hanzi uniques, et les utilise pour constituer le gros de son vocabulaire. C'est une amélioration bienvenue, car les étudiants peuvent maintenant se reposer sur peu de hanzi pour produire une quantité importante de mots : au niveau 5 le nombre de mots maitrisés est le triple du nombre de hanzi appris ! Cependant, il y a forcément un inconvénient, au discutait plus haut du nombre brut de mots appris entre chaque version, et si l'on ajoute au fait que nombre de mots introduits dans le HSK3.0 ne sont en réalité pas de vrais nouveaux mots qu'en plus les mots sont limités dans les hanzi qu'ils peuvent puiser, alors on se rend compte que bien qu'on retrouve le même nombre de hanzi maitrisés au niveau 5 de chaque version, cela n'est plus vrai pour le niveau 6. Les deux versions ont une différence de 860 hanzi uniques, en faveur de HSK2.0. Cette différence correspond au retrait pur et simple de 414 mots et le déplacement de 1600 mots de niveaux inférieurs vers le niveau 7-9. En résumé, bien que l'apprentissage dans la version 3.0 soit plus lissé dans le temps, son niveau 6, bien que d'un point de vue vocabulaire brut soit identique, est en fin de compte bien moins avancé en complexité de vocabulaire que dans la version 2.0.

source: HSK2.0 vocabulary
fr: Vocabulaire du HSK2.0

source: HSK3.0 vocabulary
fr: Vocabulaire du HSK3.0

source: HSK2.0 unique hanzi list ({length} hanzi)
fr: Liste d'hanzi uniques du HSK2.0 ({length} hanzi)

source: HSK3.0 unique hanzi list ({length} hanzi)
fr: Liste d'hanzi uniques du HSK3.0 ({length} hanzi)

source: HSK3.0 and HSK2.0 unique vocabulary words ({length} words)
fr: Mots uniques du HSK3.0 et HSK2.0 ({length} mots)

source: HSK3.0 and HSK2.0 unique hanzi list ({length} hanzi)
fr: Hanzi uniques du HSK3.0 et HSK2.0 ({length} mots)
